DataProcessors/ОбновлениеМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>ОбновлениеМеню</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НоменклатураМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураМеню</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АкцизныйНалог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>Базовая единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Безнадбавочный</Name>
					<Comment>На товар не распространяются ни какие надбавки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Безскидочный</Name>
					<Comment>На товар не распространяются ни какие скидки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Comment>Версия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Весовой</Name>
					<Comment>Весовой товар</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заменяемый</Name>
					<Comment>Товар заменяется в чеке</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЗаменяемостьНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модифицируемый</Name>
					<Comment>Блюдо имеет неотъемлемый модификатор</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Набор</Name>
					<Comment>Набор товаров и блюд</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Comment>Краткое наименование, для ККМ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПенсионныйФонд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Печатаемый</Name>
					<Comment>Печать товара в пречеке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Comment>Себестоимость</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Все виды услуг</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Розничная цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ценовой</Name>
					<Comment>Товар имеющий цену</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Штучный</Name>
					<Comment>Штучный товар</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСравнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КомплектующиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>КомплектующиеНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплектующая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КомплектующиеМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>КомплектующиеМеню</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплектующая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ОбновлениеМеню/Ext/ObjectModule.bsl
Процедура Обновить() Экспорт
	
	ПолучитьФорму("Форма").Открыть();
	
КонецПроцедуры // Обновить()             

  
Функция ДобавитьОбновитьНоменклатуруМеню(Ном, ДатаРасчетов=Неопределено, Реквизиты = Неопределено, ОбновленноеКоличество = Неопределено, ОбщееКоличество = Неопределено) Экспорт
	
	//Запрос = Новый Запрос;	
	//Запрос.УстановитьПараметр("НоменклатураМеню", НоменклатураМеню.Ссылка);
	//
	//Запрос.Текст = "
	//|ВЫБРАТЬ 
	//|	ДанныеМеню.Номенклатура.Ссылка КАК Номенклатура
	//|ИЗ
	//|	РегистрСведений.НоменклатураМеню Как ДанныеМеню
	//|ГДЕ
	//|	Номенклатура.Ссылка  = &НоменклатураМеню
	//|";
	
	//РезультатЗапроса = Запрос.Выполнить();
	Номенклатура = Неопределено;
	Если ТипЗнч(Номенклатура) <> Тип("СправочникСсылка.Номенклатура") Тогда
		Номенклатура = Ном.Ссылка;
	Иначе
		Номенклатура = Ном ;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НоменклатураМеню.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Использование = Истина;
	НаборЗаписей.Отбор.Номенклатура.Значение = Номенклатура;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	Запись.Код = Номенклатура.Код;
	Запись.Номенклатура = Номенклатура;
	Запись.Артикул = Номенклатура.Артикул;
	Запись.Наименование = Номенклатура.Наименование;
	Запись.НаименованиеПолное = Номенклатура.НаименованиеПолное;
	Запись.НаименованиеСокращенное = Номенклатура.НаименованиеСокращенное;
	Запись.БазоваяЕдиницаИзмерения = Номенклатура.БазоваяЕдиницаИзмерения;
	Запись.СтавкаНДС = Номенклатура.СтавкаНДС;
	Запись.ТипНоменклатуры = Номенклатура.ТипНоменклатуры;
	Запись.Безнадбавочный = Номенклатура.Безнадбавочный;
	Запись.Безскидочный = Номенклатура.Безскидочный;   		
	//Версия 
	//из номенклатуры - версию не пишу (объект)
	//из меню - версию не пишу (ссылка)        
	Если Номенклатура.Ссылка = Номенклатура.Ссылка.Ссылка Тогда
		Запись.Версия = Номенклатура.Версия;
	КонецЕсли;	
	Запись.Весовой 				= Номенклатура.Весовой;
	Запись.Заменяемый           = Номенклатура.Заменяемый;
	Запись.Модифицируемый       = Номенклатура.Модифицируемый;
	Запись.Набор                = Номенклатура.Набор;
	Запись.НоменклатурнаяГруппа = Номенклатура.НоменклатурнаяГруппа;
	Запись.Организация          = Номенклатура.НоменклатурнаяГруппа.Организация;
	Запись.ПенсионныйФонд       = Номенклатура.ПенсионныйФонд;
	Запись.Печатаемый           = Номенклатура.Печатаемый;
	Запись.СтавкаНДС            = Номенклатура.СтавкаНДС;
	Запись.ТипНоменклатуры      = Номенклатура.ТипНоменклатуры;
	Запись.Услуга               = Номенклатура.Услуга;
	Запись.Ценовой              = Номенклатура.Ценовой;
	Запись.Штучный              = Номенклатура.Штучный;
	Запись.ЭтоГруппа            = Номенклатура.ЭтоГруппа;
	
	//// -- Цены.  	
	//Если (ТипЗнч(НоменклатураМеню) = Тип("ВыборкаИзРезультатаЗапроса")) Тогда
	//	Запись.Цена = НоменклатураМеню.Цена;
	//	Запись.Себестоимость = НоменклатураМеню.Себестоимость;
	//Иначе
		СтруктураРесурсов = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ДатаРасчетов, Новый Структура("Номенклатура", Номенклатура));
		Запись.Цена = СтруктураРесурсов.Цена;
		Запись.Себестоимость = СтруктураРесурсов.Себестоимость;
	//КонецЕсли;
	
	// Запись набора записей.
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ОбщегоНазначения.СообщитьОбОшибкеЗапеисиРегистра("При записи элемента: "+Запись.Наименование+" произошла ошибка: "+ОписаниеОшибки(), , ,, НаборЗаписей, Номенклатура);
		Возврат Ложь;
	КонецПопытки;
	
	//НаборЗаписей = РегистрыСведений.НоменклатураМеню.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Номенклатура.Использование = Истина;
	//НаборЗаписей.Отбор.Номенклатура.Значение = Номенклатура;
	//Запись = НаборЗаписей.Добавить();
	//
	////запись данных по Модификаторам
	//Запрос = Новый Запрос;	
	//Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	МодификаторыНоменклатуры.Номенклатура,
	//			   |	МодификаторыНоменклатуры.Модификатор,
	//			   |	МодификаторыНоменклатуры.Актуальность
	//			   |ИЗ
	//			   |	РегистрСведений.МодификаторыНоменклатуры КАК МодификаторыНоменклатуры
	//			   |ГДЕ
	//			   |	МодификаторыНоменклатуры.Номенклатура = &Номенклатура";
	//																										   
	//РезультатЗапроса = Запрос.Выполнить();
	//Если НЕ(РезультатЗапроса.Пустой()) Тогда
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Пока Выборка.Следующий() Цикл                 						
	//		НаборЗаписей = РегистрыСведений.МодификаторыМеню.СоздатьНаборЗаписей();				
	//		НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура, Истина);
	//		НаборЗаписей.Отбор.Модификатор.Установить(Выборка.Модификатор, Истина);
	//		Запись = НаборЗаписей.Добавить();
	//		Запись.Номенклатура = Номенклатура.Ссылка;
	//		Запись.Модификатор = Выборка.Модификатор.Ссылка;
	//		Запись.Актуальность = Выборка.Актуальность;
	//		Запись.ТипМодификатора = Перечисления.ТипыСтрокЗаказов.ПустаяСсылка();//Выборка.ТипМодификатора;
	//		//Запись.Неотъемлемый = Выборка.Неотъемлемый;			
	//		// Запись набора записей.
	//		Попытка
	//			НаборЗаписей.Записать(Истина);
	//		Исключение
	//			ОбщегоНазначения.СообщитьОбОшибкеЗапеисиРегистра(ОписаниеОшибки(), , ,, НаборЗаписей, Номенклатура);
	//			Возврат Ложь;
	//		КонецПопытки; 	
	//	КонецЦикла;					
	//КонецЕсли;	
	
	//запись данных по Комплектующим
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Комплектующая,
	|	Количество
	|ИЗ
	|	РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	|ГДЕ
	|	КомплектующиеНоменклатуры.Номенклатура = &Номенклатура
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ(РезультатЗапроса.Пустой()) Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл                 						
			НаборЗаписей = РегистрыСведений.КомплектующиеМеню.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Номенклатура.Использование = Истина;			
			НаборЗаписей.Отбор.Номенклатура.Значение = Номенклатура.Ссылка;						
			НаборЗаписей.Отбор.Комплектующая.Использование = Истина;
			НаборЗаписей.Отбор.Комплектующая.Значение = Выборка.Комплектующая.Ссылка;
			Запись = НаборЗаписей.Добавить();
			Запись.Номенклатура = Номенклатура.Ссылка;
			Запись.Комплектующая = Выборка.Комплектующая.Ссылка;
			Запись.Количество = Выборка.Количество;
			// Запись набора записей.
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
				ОбщегоНазначения.СообщитьОбОшибкеЗапеисиРегистра(ОписаниеОшибки(), , ,, НаборЗаписей, Номенклатура);
				Возврат Ложь;
			КонецПопытки; 	
		КонецЦикла;					
	КонецЕсли;
	Если НЕ(ОбновленноеКоличество=Неопределено) Тогда
		ОбновленноеКоличество = ОбновленноеКоличество+1;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

//из номенклатуры - версию не пишу (объект)
//из меню - версию не пишу (ссылка)         Ссылка = Ссылка.Ссылка
Функция ДобавитьНоменклатуруМеню(Ссылка = Неопределено, ДатаРасчетов = Неопределено, Реквизиты = Неопределено, ОбновленноеКоличество = Неопределено, ОбщееКоличество = Неопределено) Экспорт
	//ДатаРасчетов = для периодики, если нет то текущая
	Возврат Истина;	
	
КонецФункции // ДобавитьНоменклатуруМеню()

// Процедура считывает и обновляет содержимое меню данного Вида меню. СОХРАНИМ!!! ВДРУГ ПОНАДОБИТСЯ!!!
//
//Функция ОбновитьМеню(ВидМеню, ДатаРасчетов = Неопределено, РеквизитыСписок = Неопределено, ОбновленноеКоличество = 0) Экспорт
//	
//	// Нормализация.
//	Если Не ЗначениеЗаполнено(ДатаРасчетов) Тогда
//		ДатаРасчетов = ТекущаяДата();
//	КонецЕсли;
//	
//	// Запись данных.
//	Попытка
//		НачатьТранзакцию();
//		
//		// -- Выборка номенклатуры меню.
//		Запрос = Новый Запрос(
//			"ВЫБРАТЬ
//			|	Меню.Ссылка КАК Ссылка,
//			|	ВЫРАЗИТЬ(Меню.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
//			|ИЗ
//			|	Справочник.Меню КАК Меню
//			|ГДЕ
//			|	Меню.Владелец = &Владелец
//			|	И НЕ Меню.ЭтоГруппа
//			|");
//		Запрос.УстановитьПараметр("Владелец", ВидМеню.Ссылка);
//		РезультатЗапроса = Запрос.Выполнить();
//		
//		Если Не РезультатЗапроса.Пустой() Тогда
//			// -- Выборка измененной номенклатуры.
//			ТаблицаРезультатаЗапроса = РезультатЗапроса.Выгрузить();
//			МассивНоменклатуры = ТаблицаРезультатаЗапроса.ВыгрузитьКолонку("Номенклатура");
//			МассивМеню = ТаблицаРезультатаЗапроса.ВыгрузитьКолонку("Ссылка");
//	
//			Запрос = Новый Запрос(
//				"ВЫБРАТЬ
//				|	Меню.Ссылка,
//				|	НоменклатураМеню.НаименованиеПолное,
//				|	НоменклатураМеню.НаименованиеСокращенное,
//				|	НоменклатураМеню.БазоваяЕдиницаИзмерения,
//				|	НоменклатураМеню.СтавкаНДС,
//				|	НоменклатураМеню.ТипНоменклатуры,
//				|	НоменклатураМеню.Безскидочный,
//				|	НоменклатураМеню.Безнадбавочный,
//				|	НоменклатураМеню.Цена,
//				|	НоменклатураМеню.Себестоимость,
//				|	НоменклатураМеню.Артикул
//				|ИЗ
//				|	Справочник.Меню КАК Меню
//				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//				|			НоменклатураМеню.Ссылка КАК Ссылка,
//				|			НоменклатураМеню.НаименованиеПолное КАК НаименованиеПолное,
//				|			НоменклатураМеню.НаименованиеСокращенное КАК НаименованиеСокращенное,
//				|			НоменклатураМеню.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения,
//				|			НоменклатураМеню.СтавкаНДС КАК СтавкаНДС,
//				|			НоменклатураМеню.ТипНоменклатуры КАК ТипНоменклатуры,
//				|			НоменклатураМеню.Безскидочный КАК Безскидочный,
//				|			НоменклатураМеню.Безнадбавочный КАК Безнадбавочный,
//				|			НоменклатураМеню.Артикул КАК Артикул,
//				|			ЦеныНоменклатуры.Цена КАК Цена,
//				|			ЦеныНоменклатуры.Себестоимость КАК Себестоимость
//				|		ИЗ
//				|			Справочник.Номенклатура КАК НоменклатураМеню
//				|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Номенклатура В (&НоменклатураМеню)) КАК ЦеныНоменклатуры
//				|				ПО НоменклатураМеню.Ссылка = ЦеныНоменклатуры.Номенклатура
//				|		ГДЕ
//				|			НоменклатураМеню.Ссылка В(&НоменклатураМеню)) КАК НоменклатураМеню
//				|		ПО Меню.Номенклатура = НоменклатураМеню.Ссылка
//				|ГДЕ
//				|	Меню.Владелец = &Владелец
//				|	И (НЕ Меню.ЭтоГруппа)
//				|	И Меню.Ссылка В(&Меню)");
//			Запрос.УстановитьПараметр("Период", ДатаРасчетов);
//			Запрос.УстановитьПараметр("НоменклатураМеню", МассивНоменклатуры);
//			Запрос.УстановитьПараметр("Владелец", ВидМеню.Ссылка);
//			Запрос.УстановитьПараметр("Меню", МассивМеню);
//	
//			// -- Обновление данных.
//			Выборка = Запрос.Выполнить().Выбрать();
//			Пока Выборка.Следующий() Цикл
//				
//				МенюОбъект = Выборка.Ссылка.ПолучитьОбъект();
//				ОбновитьНоменклатуруМеню(МенюОбъект, Выборка);
//				МенюОбъект.Записать();
//				
//				ОбновленноеКоличество = ОбновленноеКоличество + 1;
//			КонецЦикла;
//			
//		КонецЕсли;
//		
//		// -- Актуализация последнего обновления.
//		//ЭтотОбъект.ПоследнееОбновление = РабочаяДата;
//		//ЭтотОбъект.СледующееОбновление = Неопределено;
//		//ЭтотОбъект.Записать();
//		
//		ЗафиксироватьТранзакцию();
//	Исключение
//		ОбщегоНазначения.СообщитьОбОшибке(":" + Символы.ПС + ОписаниеОшибки());
//		
//		Если ТранзакцияАктивна() Тогда
//			ОтменитьТранзакцию();
//		КонецЕсли;
//		
//		Возврат Ложь;
//	КонецПопытки;
//	
//	// Успешное изменение данных.
//	Возврат Истина;
//	
//КонецФункции // ОбновитьМеню()


//ДобавитьНоменклатуруМеню(Ссылка = Неопределено, ДатаРасчетов = Неопределено, Реквизиты = Неопределено, ОбновленноеКолличество = Неопределено, ОбщееКоличество = Неопределено) Экспорт
//Функция ОбновитьНоменклатуруМеню(Ссылка, ДатаРасчетов = Неопределено) Экспорт	
//	//ДатаРасчетов = для периодики, если нет то тЕкущая
//	Возврат Истина;	
//	
//КонецФункции // ОбновитьНоменклатуру()
